blog/lisp-uninitiated.org
#+TITLE: Lisp for the uninitiated
#+SETUPFILE: ../templates/html.org
#+INCLUDE: header.org

* About Lisp

#+begin_quote
Study C to see the power of a computer without the constraints of a language. Study Lisp to see the
power of a language without the constraints of a computer. Even if you never use either language 
professionally, they will both fundamentally change how you code for the better.
#+end_quote

This is one of my favourite quotes about Lisp, and even though it's from a random reddit user, I 
believe it holds true. People often talk about Lisp as though it's some infinitely powerful 
language and mysterious and blah blah blah. While it's true that Lisp is very powerful, it's not 
mysterious or complicated how it works.

This article is targeted towards people who maybe took a class in Lisp and really hated it, or had 
a friend show it to them but poorly explained it and were left confused, wonder why the hell you'd 
use something so esoteric or archaic. If you've never used Lisp before, but are maybe curious, 
check out my other post about [learning Lisp](lisp-for-beginners.html).

To start, I want to clarify that Lisp itself isn't really a programming language. Lisp is a /family/
of programming languages. Just like the "C family" covers C, C++, C#, Java, JS, Go, etc., the Lisp
family covers Common Lisp, Clojure, Emacs Lisp, Hy, Scheme, Racket, etc. When people say "Lisp",
they're usually either referring to Common Lisp, but there's more to the world of Lisp than CL.

* Lisp Syntax

We all know and recognize C-like languages, they've got their curly braces, maybe semi-colons, if
statements, for and while loops, etc. But what does a Lisp look like if not that? Lisp uses a type
of syntax called s-expressions, and they look like this:

#+begin_src common-lisp
(defun my-adder (number-1 number-2)
  (print number-1)
  (print number-2)
  (print (+ number-1 number-2)))
#+end_src

This code is pretty simple to figure out what's going on: it defines a function (with ~defun~) named 
~my-adder~ that accepts two parameters. The body of the function simply prints those two parameters, 
and then prints their sum.

There's nothing particularly complicated about this, but there is a lot to unpack here if you're
unfamiliar with the syntax. The first thing you'll probably notice is that there's a lot of
parenthesis everywhere. ~defun~ is inside parenthesis, the ~print~ function has parenthesis /before/ the
function name, which is kind of weird, and even the ~+~ has parenthesis around it. There's a very good
reason for this: in Lisp, almost everything is a function. Anything that isn't a function, like
~defun~, uses the same syntax as function calls though. ~+~ is a function that adds two number. ~print~ is
a function that writes it's argument to stdout.

* Prefix notation

This is pretty unfamiliar to most people, but I promose it has a very good reason for being like 
this! Think about the following code in C/C++:
#+begin_src cpp
int * a1, a2;
#+end_src

What does this code do? We know that it declared 2 variables ~a1~ and ~a2~, that's not too complicated.
But we also have this ~*~ in here that's declaring them as pointers. Or is it? Is it declaring both of
them as pointers or just ~a1~? To a reader, this code is *ambiguous* unless you know the order of
precedence of operations in C++. What you might /think/ this code does is creates two pointers to
integers, since the ~*~ is a part of the type, and so it should apply to both ~a1~ and ~a2~. However in
practice, only ~a1~ is a pointer and ~a2~ is just an integer.

In Lisp, we don't have this problem with operator precedence. The way that we do math in Lisp is like so:
#+begin_src lisp
(print (+ 3 (* 2 (+ 4 5))))
#+end_src

And this means that we're first adding ~4 + 5~, then multiplying ~2 * 9~, then adding ~3 + 18~ to get ~21~.
There's no order of orperations in Lisp, so everything is entirely unambiguous. This is one small,
but undeniable advantage to writing code using s-expressions. But this is only a small advantage
compared, the real gain comes with how we represent *data* in Lisp.

