docs/assets/lisp-uninitiated.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-17 Thu 15:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lisp for the uninitiated</title>
<meta name="author" content="Philip" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lisp for the uninitiated</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org308c132">1. About Lisp</a></li>
<li><a href="#orgb5a59d2">2. Lisp Syntax</a></li>
<li><a href="#org12d5125">3. Prefix notation</a></li>
<li><a href="#orgce1ae87">4. Representing data</a></li>
<li><a href="#org173e9c0">5. Macros</a></li>
<li><a href="#org05df910">6. Reader macros</a></li>
<li><a href="#org1f78e6f">7. Dialects</a></li>
<li><a href="#org3f86793">8. Conclusion</a>
<ul>
<li><a href="#orgb864614">8.1. Clojure</a></li>
<li><a href="#org9b3abad">8.2. Common Lisp</a></li>
<li><a href="#org997cec7">8.3. Racket</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<a href="../index.html">Home</a> | <a href="../about.html">About</a> | <a href="../contact.html">Contact</a>
</p>
</div>

<div id="outline-container-org308c132" class="outline-2">
<h2 id="org308c132"><span class="section-number-2">1.</span> About Lisp</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Study C to see the power of a computer without the constraints of a language. Study Lisp to see the
power of a language without the constraints of a computer. Even if you never use either language 
professionally, they will both fundamentally change how you code for the better.
</p>
</blockquote>

<p>
This is one of my favourite quotes about Lisp, and even though it&rsquo;s from a random reddit user, I 
believe it holds true. People often talk about Lisp as though it&rsquo;s some infinitely powerful 
language and mysterious and blah blah blah. While it&rsquo;s true that Lisp is very powerful, it&rsquo;s not 
mysterious or complicated how it works.
</p>

<p>
This article is targeted towards people who maybe took a class in Lisp and really hated it, or had 
a friend show it to them but poorly explained it and were left confused, wonder why the hell you&rsquo;d 
use something so esoteric or archaic. If you&rsquo;ve never used Lisp before, but are maybe curious, 
check out my other post about [learning Lisp](lisp-for-beginners.html).
</p>

<p>
To start, I want to clarify that Lisp itself isn&rsquo;t really a programming language. Lisp is a <i>family</i>
of programming languages. Just like the &ldquo;C family&rdquo; covers C, C++, C#, Java, JS, Go, etc., the Lisp
family covers Common Lisp, Clojure, Emacs Lisp, Hy, Scheme, Racket, etc. When people say &ldquo;Lisp&rdquo;,
they&rsquo;re usually either referring to Common Lisp, but there&rsquo;s more to the world of Lisp than CL.
</p>
</div>
</div>

<div id="outline-container-orgb5a59d2" class="outline-2">
<h2 id="orgb5a59d2"><span class="section-number-2">2.</span> Lisp Syntax</h2>
<div class="outline-text-2" id="text-2">
<p>
We all know and recognize C-like languages, they&rsquo;ve got their curly braces, maybe semi-colons, if
statements, for and while loops, etc. But what does a Lisp look like if not that? Lisp uses a type
of syntax called s-expressions, and they look like this:
</p>

<div class="org-src-container">
<pre class="src src-common-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">my-adder</span> <span style="color: #c678dd;">(</span>number-1 number-2<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print number-1<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print number-2<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print <span style="color: #98be65;">(</span>+ number-1 number-2<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
This code is pretty simple to figure out what&rsquo;s going on: it defines a function (with <code>defun</code>) named 
<code>my-adder</code> that accepts two parameters. The body of the function simply prints those two parameters, 
and then prints their sum.
</p>

<p>
There&rsquo;s nothing particularly complicated about this, but there is a lot to unpack here if you&rsquo;re
unfamiliar with the syntax. The first thing you&rsquo;ll probably notice is that there&rsquo;s a lot of
parenthesis everywhere. <code>defun</code> is inside parenthesis, the <code>print</code> function has parenthesis <i>before</i> the
function name, which is kind of weird, and even the <code>+</code> has parenthesis around it. There&rsquo;s a very good
reason for this: in Lisp, almost everything is a function. Anything that isn&rsquo;t a function, like
<code>defun</code>, uses the same syntax as function calls though. <code>+</code> is a function that adds two number. <code>print</code> is
a function that writes it&rsquo;s argument to stdout.
</p>
</div>
</div>

<div id="outline-container-org12d5125" class="outline-2">
<h2 id="org12d5125"><span class="section-number-2">3.</span> Prefix notation</h2>
<div class="outline-text-2" id="text-3">
<p>
This is pretty unfamiliar to most people, but I promose it has a very good reason for being like 
this! Think about the following code in C/C++:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #ECBE7B;">int</span> * <span style="color: #dcaeea;">a1</span>, <span style="color: #dcaeea;">a2</span>;
</pre>
</div>

<p>
What does this code do? We know that it declared 2 variables <code>a1</code> and <code>a2</code>, that&rsquo;s not too complicated.
But we also have this <code>*</code> in here that&rsquo;s declaring them as pointers. Or is it? Is it declaring both of
them as pointers or just <code>a1</code>? To a reader, this code is <b>ambiguous</b> unless you know the order of
precedence of operations in C++. What you might <i>think</i> this code does is creates two pointers to
integers, since the <code>*</code> is a part of the type, and so it should apply to both <code>a1</code> and <code>a2</code>. However in
practice, only <code>a1</code> is a pointer and <code>a2</code> is just an integer.
</p>

<p>
In Lisp, we don&rsquo;t have this problem with operator precedence. The way that we do math in Lisp is like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>print <span style="color: #c678dd;">(</span>+ <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #98be65;">(</span>* <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #a9a1e1;">(</span>+ <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And this means that we&rsquo;re first adding <code>4 + 5</code>, then multiplying <code>2 * 9</code>, then adding <code>3 + 18</code> to get <code>21</code>.
There&rsquo;s no order of orperations in Lisp, so everything is entirely unambiguous. This is one small,
but undeniable advantage to writing code using s-expressions. But this is only a small advantage
compared, the real gain comes with how we represent <b>data</b> in Lisp.
</p>
</div>
</div>
