blog/lisp-uninitiated.org
* Representing data

The central data structure in Lisp is the *singly-linked lists*. If you think List and Lisp are too
close sounding, that's because Lisp used to be an ackronym meaning LISt Processor. The way you
create a single linked list is like this:

#+begin_src lisp
(defvar my-list (list 1 2 3 4 5))
(print my-list) ; (1 2 3 4 5)
#+end_src

Since all of the values in that list are constant, we could equally declare that list as so:
#+begin_src lisp
(defvar my-list '(1 2 3 4 5))
#+end_src

What that quote means in Lisp is that the expression after it is not to be evaluated and everything
should be treated literaly. This means to create a nested list I could do:
#+begin_src lisp
(print '((1 2 3) (:a :b :c)))
#+end_src

And doing this is much simpler than writing out
#+begin_src lisp
(print (list (list 1 2 3) (list :a :b :c)))
#+end_src

Now, notice how the syntax for creating lists is the same as the syntax for everything else. If we do
#+begin_src lisp
(print (let ((x 10) (y 20))
         (+ x y)))
#+end_src

This code will declare variables ~x~ and ~y~, calculate their sum, and then print them. But if we do
#+begin_src lisp
(print '(let ((x 10) (y 20))
          (+ x y)))
#+end_src

This code is now entirely different. It won't print the sum of the two numbers, this is now a nested
list. The first element of the list is the symbol ~let~ followed by another nested list, followed by
another list whose first element is ~+~, then ~x~, then ~y~. This list would kind of be equivalent to the
following in JavaScript
#+begin_src java
console.log([Symbol("let"), [[Symbol("x"), 10], [Symbol("y"), 20]],
             [Symbol("+"), Symbol("x"), Symbol("y")]])
#+end_src

But in Lisp, the syntax for creating lists is the exact same syntax as that for writing code. This
is a feature of a small number of programming languages that we call homoiconicity. This becomes
very important in understanding Lisp's *macros.*

