docs/assets/lisp-uninitiated.html

<div id="outline-container-orgce1ae87" class="outline-2">
<h2 id="orgce1ae87"><span class="section-number-2">4.</span> Representing data</h2>
<div class="outline-text-2" id="text-4">
<p>
The central data structure in Lisp is the <b>singly-linked lists</b>. If you think List and Lisp are too
close sounding, that&rsquo;s because Lisp used to be an ackronym meaning LISt Processor. The way you
create a single linked list is like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">my-list</span> <span style="color: #c678dd;">(</span>list <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
<span style="color: #51afef;">(</span>print my-list<span style="color: #51afef;">)</span> <span style="color: #5B6268;">; (1 2 3 4 5)</span>
</pre>
</div>

<p>
Since all of the values in that list are constant, we could equally declare that list as so:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defvar</span> <span style="color: #dcaeea;">my-list</span> '<span style="color: #c678dd;">(</span><span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">3</span> <span style="color: #da8548; font-weight: bold;">4</span> <span style="color: #da8548; font-weight: bold;">5</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
What that quote means in Lisp is that the expression after it is not to be evaluated and everything
should be treated literaly. This means to create a nested list I could do:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>print '<span style="color: #c678dd;">(</span><span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span><span style="color: #c678dd;">:a</span> <span style="color: #c678dd;">:b</span> <span style="color: #c678dd;">:c</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
And doing this is much simpler than writing out
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>print <span style="color: #c678dd;">(</span>list <span style="color: #98be65;">(</span>list <span style="color: #da8548; font-weight: bold;">1</span> <span style="color: #da8548; font-weight: bold;">2</span> <span style="color: #da8548; font-weight: bold;">3</span><span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>list <span style="color: #c678dd;">:a</span> <span style="color: #c678dd;">:b</span> <span style="color: #c678dd;">:c</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Now, notice how the syntax for creating lists is the same as the syntax for everything else. If we do
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>print <span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>x <span style="color: #da8548; font-weight: bold;">10</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">(</span>y <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
         <span style="color: #98be65;">(</span>+ x y<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
This code will declare variables <code>x</code> and <code>y</code>, calculate their sum, and then print them. But if we do
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>print '<span style="color: #c678dd;">(</span><span style="color: #51afef;">let</span> <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>x <span style="color: #da8548; font-weight: bold;">10</span><span style="color: #a9a1e1;">)</span> <span style="color: #a9a1e1;">(</span>y <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
          <span style="color: #98be65;">(</span>+ x y<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
This code is now entirely different. It won&rsquo;t print the sum of the two numbers, this is now a nested
list. The first element of the list is the symbol <code>let</code> followed by another nested list, followed by
another list whose first element is <code>+</code>, then <code>x</code>, then <code>y</code>. This list would kind of be equivalent to the
following in JavaScript
</p>
<div class="org-src-container">
<pre class="src src-java">console.log<span style="color: #51afef;">(</span><span style="color: #c678dd;">[</span>Symbol<span style="color: #98be65;">(</span><span style="color: #98be65;">"let"</span><span style="color: #98be65;">)</span>, <span style="color: #98be65;">[</span><span style="color: #a9a1e1;">[</span>Symbol<span style="color: #51afef;">(</span><span style="color: #98be65;">"x"</span><span style="color: #51afef;">)</span>, <span style="color: #da8548; font-weight: bold;">10</span><span style="color: #a9a1e1;">]</span>, <span style="color: #a9a1e1;">[</span>Symbol<span style="color: #51afef;">(</span><span style="color: #98be65;">"y"</span><span style="color: #51afef;">)</span>, <span style="color: #da8548; font-weight: bold;">20</span><span style="color: #a9a1e1;">]</span><span style="color: #98be65;">]</span>,
             <span style="color: #98be65;">[</span>Symbol<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"+"</span><span style="color: #a9a1e1;">)</span>, Symbol<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"x"</span><span style="color: #a9a1e1;">)</span>, Symbol<span style="color: #a9a1e1;">(</span><span style="color: #98be65;">"y"</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
But in Lisp, the syntax for creating lists is the exact same syntax as that for writing code. This
is a feature of a small number of programming languages that we call homoiconicity. This becomes
very important in understanding Lisp&rsquo;s <b>macros.</b>
</p>
</div>
</div>
