blog/lisp-uninitiated.org
* Macros

In C and C++ you can define what are called macros. Macros in C/C++ are pieces of code that when
called, will replace the call to the macro with the text that it's declared as *at compile time*. For
example:
#+begin_src cpp
#define print(a) std::cout << a << std::endl

print("hello");
#+end_src

What this would do is when you compile this code, a *textual-substituion* takes place. The code 
~print("hello")~ would actually get replaced by the code ~std::cout << a << std::endl~. This is a pretty
convenient feature - we can use it for writing very small "functions" and have them get replaced by
their definitions at compile time to eliminate the overhead of calling a function and creating a 
new stack frame.

In Lisp though, we have something even better. In Lisp, macros are actual functions that evaluate
at compile time. That sounds kinda complicated, so here's an example:
#+begin_src lisp
(defmacro infix->prefix (func-call)
  (list (second func-call) (first func-call) (third func-call)))
#+end_src

What this does is it defines a macro called ~infix->prefix~, and it takes a function "form" as a
parameter. The function ~first~ will extract the first element of a list, ~second~ will extract the second,
and ~third~ will predictably extract the 3rd. It then takes those elements and returns a new list,
with the elements in a different order so the second is now the first.

If you we're to call this like so:
#+begin_src lisp
(print (infix->prefix (1 + 2)))
#+end_src

Then what this does is at compile time, it'll transform the list ~(1 + 2)~ into ~(+ 1 2)~, so that when 
it comes time for the program to execute, it'll evaluate as ~(+ 1 2)~ and print it at run-time.

While this example might seem somewhat trivial and not that much more powerful that C/C++ macros, 
here's a quote that describes the difference between the two quite well:
#+begin_quote
In most programming languages, syntax is complex. Macros have to take apart program syntax, analyze 
it, and reassemble it. They do not have access to the program's parser, so they have to depend on 
heuristics and best-guesses. Sometimes their cut-rate analysis is wrong, and then they break.

But Lisp is different. Lisp macros do have access to the parser, and it is a really simple parser. 
A Lisp macro is not handed a string, but a pre-parsed piece of source code in the form of a list, 
because the source of a Lisp program is not a string; it is a list. And Lisp programs are really 
good at taking apart lists and putting them back together. They do this reliably, every day."

- Ben Tilly
#+end_quote

Since Lisp is able to do much more complicated preprocessing like this with macros, the 
possibilities are endless. For example, you can define HTML-like syntax in Lisp for building a web 
framework pretty trivially:
#+begin_src lisp
(html
  (head (title "hello world"))
  (body ((color "green"))
    (p "This is some green text")))
#+end_src

We can also define macros to create new control-flow structures. For example, in Lisp ~if~ can be a
little annoying sometimes because it looks like ~(if <cond> <then-expr> <else-expr>)~ - this means
that your cases can only contain one expression each. But what if you don't want an ~else~, and you
want several lines in your ~then~ case? Well, building a macro for this is really easy.
#+begin_src lisp
(defmacro when (condition &rest body)
  `(if ,condition (progn ,@body) nil))
#+end_src

We can then use this like so:
#+begin_src lisp
(when (= x y)
  (print x)
  (print y)
  (print (+ x y)))
#+end_src

without worrying about the fact that you have multiple expressions in your body.

Macros are a very powerful abstraction tool that can allow you to represent repetitive complex
things in your code in a much more concise way. Like functions, they're just another building block
that Lisps give you access to so that you can build complex software as cleanly as possible.

If these regular macros don't sound very interesting to you, many lisp dialects such as Common Lisp
and Racket allow you to push it a step further and completly re-write the syntax of the language
using what they call *reader macros*.

