docs/assets/lisp-uninitiated.html

<div id="outline-container-org173e9c0" class="outline-2">
<h2 id="org173e9c0"><span class="section-number-2">5.</span> Macros</h2>
<div class="outline-text-2" id="text-5">
<p>
In C and C++ you can define what are called macros. Macros in C/C++ are pieces of code that when
called, will replace the call to the macro with the text that it&rsquo;s declared as <b>at compile time</b>. For
example:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #51afef; font-weight: bold;">#define</span> <span style="color: #c678dd;">print</span><span style="color: #51afef;">(</span><span style="color: #dcaeea;">a</span><span style="color: #51afef;">)</span> <span style="color: #a9a1e1;">std</span>::cout &lt;&lt; a &lt;&lt; <span style="color: #a9a1e1;">std</span>::endl

print<span style="color: #51afef;">(</span><span style="color: #98be65;">"hello"</span><span style="color: #51afef;">)</span>;
</pre>
</div>

<p>
What this would do is when you compile this code, a <b>textual-substituion</b> takes place. The code 
<code>print("hello")</code> would actually get replaced by the code <code>std::cout &lt;&lt; a &lt;&lt; std::endl</code>. This is a pretty
convenient feature - we can use it for writing very small &ldquo;functions&rdquo; and have them get replaced by
their definitions at compile time to eliminate the overhead of calling a function and creating a 
new stack frame.
</p>

<p>
In Lisp though, we have something even better. In Lisp, macros are actual functions that evaluate
at compile time. That sounds kinda complicated, so here&rsquo;s an example:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defmacro</span> <span style="color: #c678dd;">infix-&gt;prefix</span> <span style="color: #c678dd;">(</span>func-call<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>list <span style="color: #98be65;">(</span>second func-call<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>first func-call<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>third func-call<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
What this does is it defines a macro called <code>infix-&gt;prefix</code>, and it takes a function &ldquo;form&rdquo; as a
parameter. The function <code>first</code> will extract the first element of a list, <code>second</code> will extract the second,
and <code>third</code> will predictably extract the 3rd. It then takes those elements and returns a new list,
with the elements in a different order so the second is now the first.
</p>

<p>
If you we&rsquo;re to call this like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>print <span style="color: #c678dd;">(</span>infix-&gt;prefix <span style="color: #98be65;">(</span><span style="color: #da8548; font-weight: bold;">1</span> + <span style="color: #da8548; font-weight: bold;">2</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
Then what this does is at compile time, it&rsquo;ll transform the list <code>(1 + 2)</code> into <code>(+ 1 2)</code>, so that when 
it comes time for the program to execute, it&rsquo;ll evaluate as <code>(+ 1 2)</code> and print it at run-time.
</p>

<p>
While this example might seem somewhat trivial and not that much more powerful that C/C++ macros, 
here&rsquo;s a quote that describes the difference between the two quite well:
</p>
<blockquote>
<p>
In most programming languages, syntax is complex. Macros have to take apart program syntax, analyze 
it, and reassemble it. They do not have access to the program&rsquo;s parser, so they have to depend on 
heuristics and best-guesses. Sometimes their cut-rate analysis is wrong, and then they break.
</p>

<p>
But Lisp is different. Lisp macros do have access to the parser, and it is a really simple parser. 
A Lisp macro is not handed a string, but a pre-parsed piece of source code in the form of a list, 
because the source of a Lisp program is not a string; it is a list. And Lisp programs are really 
good at taking apart lists and putting them back together. They do this reliably, every day.&ldquo;
</p>

<ul class="org-ul">
<li>Ben Tilly</li>
</ul>
</blockquote>

<p>
Since Lisp is able to do much more complicated preprocessing like this with macros, the 
possibilities are endless. For example, you can define HTML-like syntax in Lisp for building a web 
framework pretty trivially:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span>html
  <span style="color: #c678dd;">(</span>head <span style="color: #98be65;">(</span>title <span style="color: #98be65;">"hello world"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>body <span style="color: #98be65;">(</span><span style="color: #a9a1e1;">(</span>color <span style="color: #98be65;">"green"</span><span style="color: #a9a1e1;">)</span><span style="color: #98be65;">)</span>
    <span style="color: #98be65;">(</span>p <span style="color: #98be65;">"This is some green text"</span><span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
We can also define macros to create new control-flow structures. For example, in Lisp <code>if</code> can be a
little annoying sometimes because it looks like <code>(if &lt;cond&gt; &lt;then-expr&gt; &lt;else-expr&gt;)</code> - this means
that your cases can only contain one expression each. But what if you don&rsquo;t want an <code>else</code>, and you
want several lines in your <code>then</code> case? Well, building a macro for this is really easy.
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defmacro</span> <span style="color: #c678dd;">when</span> <span style="color: #c678dd;">(</span>condition <span style="color: #ECBE7B;">&amp;rest</span> body<span style="color: #c678dd;">)</span>
  `<span style="color: #c678dd;">(</span><span style="color: #51afef;">if</span> ,condition <span style="color: #98be65;">(</span><span style="color: #51afef;">progn</span> ,@body<span style="color: #98be65;">)</span> nil<span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
We can then use this like so:
</p>
<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">when</span> <span style="color: #c678dd;">(</span>= x y<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print x<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print y<span style="color: #c678dd;">)</span>
  <span style="color: #c678dd;">(</span>print <span style="color: #98be65;">(</span>+ x y<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>
</pre>
</div>

<p>
without worrying about the fact that you have multiple expressions in your body.
</p>

<p>
Macros are a very powerful abstraction tool that can allow you to represent repetitive complex
things in your code in a much more concise way. Like functions, they&rsquo;re just another building block
that Lisps give you access to so that you can build complex software as cleanly as possible.
</p>

<p>
If these regular macros don&rsquo;t sound very interesting to you, many lisp dialects such as Common Lisp
and Racket allow you to push it a step further and completly re-write the syntax of the language
using what they call <b>reader macros</b>.
</p>
</div>
</div>
