blog/lisp-uninitiated.org
* Reader macros
While normal macros are able to transform your code into a new form, *reader macros* are able to
transform code that previously wasn't in valid Lisp syntax into valid syntax. This means that you
can not  only transform the code at compile time, but you can create your own syntax for an entirely
new language.

Remember earlier we talked about how that quote would make everything after it get interpreted 
literally? Well ~quote~ is actually the name of a macro that does that, and the ~'~ that we use is a 
*reader macro* that transforms it into the `quote` macro form. We can define the ~'~ reader macro like 
this:

#+begin_src lisp
(defun single-quote-reader (stream char)
   (declare (ignore char))
   (list (quote quote) (read stream t nil t)))

(set-macro-character #\' #'single-quote-reader)
#+end_src

This will tell the Lisp compiler "when you see the ~'~ character, take the s-expression following it, 
and give it to the function ~single-quote-reader~". This allows us to extend the syntax of our 
language pretty simply by telling the compiler what to do when it sees a quote. Now remember how we 
had that HTML-like code, except it was still really just Lisp syntax? Well using reader macros we 
can change that and make something like this if we wanted:
#+begin_src html
<html>
  <head>
    <title>Hello world</title>
  </head>
  <body style="color: green">
    <p>This is some green text</p>
  </body>
</html>
#+end_src

This can be perfectly valid Common Lisp or Racket code. It would get transformed by a complicated
set of reader macros into the s-expression version above, which would then get translated into some
more complicated generation code.

You can do some incredibly cool, and complicated stuff with reader macros such as:
- [[https://lisper.in/reader-macros][Allow JSON syntax in Lisp]]
- [[https://stackoverflow.com/questions/267862/what-makes-lisp-macros-so-special#answer-4621882][Write Python-like list comprehension]]
- [[https://github.com/y2q-actionman/with-c-syntax/][Embed C syntax directly into Lisp code]]

* Dialects
As mentioned at the beginning of the article, there are several dialects of Lisp. Some of the most common
ones are Clojure, Common Lisp, Scheme, Racket, and Emacs Lisp. If you're thinking of learning one of
them, [[file:which-lisp.org][maybe this can help you chose]] a dialect to learn.

* Conclusion
I hope you walk away from reading this understanding why Lisp is interesting. I know that it takes a
while to get used to it, and many people that learn it have a gut reaction to hate it, but
understanding the method behind the madness will make it easier to grasp.

If you're interested in taking some of the first steps to learning Lisp, check out some of the
resources below:

** Clojure
- [[https://www.braveclojure.com/clojure-for-the-brave-and-true/][Clojure for the Brave and True]]
- [[https://learnxinyminutes.com/docs/clojure/][Learn Clojure in Y minutes]]
- [[https://clojure.org/api/cheatsheet][Clojure Cheatsheet]]

** Common Lisp
- [[https://gigamonkeys.com/book/][Practical Common Lisp (jump to Chapter 3)]]
- [[https://learnxinyminutes.com/docs/common-lisp/][Learn Common Lisp in Y minutes]]

** Racket
- [[https://docs.racket-lang.org/quick/][An introduction Racket with Pictures]]
- [[https://docs.racket-lang.org/more/][Systems Programming with Racket ]]


And if you're curious about the real-world applications of Lisp, or just want some more
encouragement to learn it, lisp sees more use than you might think:
- [[https://lisp-lang.org/][Grammarly uses Common Lisp]] for natural language processing
- [[https://lisp-lang.org/][Google's flight search engine uses Common Lisp]]
- [[https://lisp-lang.org/success/][Dozens of other companies]] use Common Lisp to much success
- [[https://boards.greenhouse.io/circleci][CircleCI]] uses [[https://circleci.com/blog/clojure-microservices-for-js-devs-pt-1/][Clojure extensively]] throughout it's [[https://circleci.com/blog/deploying-clojure-applications-to-google-cloud/][full stack]]
- Clojure is used by [[https://clojure.org/community/companieshundreds][hundreds of other companies]], like Apple, Facebook, Walmart, and more
- Clojure developers are [[https://insights.stackoverflow.com/survey/2018/#work-_-salary-and-experience-by-language][consistently]] some [[https://insights.stackoverflow.com/survey/2019#technology-_-what-languages-are-associated-with-the-highest-salaries-worldwide][the best paid]] in [[https://insights.stackoverflow.com/survey/2021#section-top-paying-technologies-top-paying-technologies][the world]]
- [[https://www.gameenginebook.com/resources/SINFO.pdf][Naughty Dog used Racket for PS3 and PS4 games]]
