docs/assets/lisp-uninitiated.html

<div id="outline-container-org05df910" class="outline-2">
<h2 id="org05df910"><span class="section-number-2">6.</span> Reader macros</h2>
<div class="outline-text-2" id="text-6">
<p>
While normal macros are able to transform your code into a new form, <b>reader macros</b> are able to
transform code that previously wasn&rsquo;t in valid Lisp syntax into valid syntax. This means that you
can not  only transform the code at compile time, but you can create your own syntax for an entirely
new language.
</p>

<p>
Remember earlier we talked about how that quote would make everything after it get interpreted 
literally? Well <code>quote</code> is actually the name of a macro that does that, and the <code>'</code> that we use is a 
<b>reader macro</b> that transforms it into the `quote` macro form. We can define the <code>'</code> reader macro like 
this:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #51afef;">(</span><span style="color: #51afef;">defun</span> <span style="color: #c678dd;">single-quote-reader</span> <span style="color: #c678dd;">(</span>stream char<span style="color: #c678dd;">)</span>
   <span style="color: #c678dd;">(</span><span style="color: #51afef;">declare</span> <span style="color: #98be65;">(</span>ignore char<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span>
   <span style="color: #c678dd;">(</span>list <span style="color: #98be65;">(</span>quote quote<span style="color: #98be65;">)</span> <span style="color: #98be65;">(</span>read stream t nil t<span style="color: #98be65;">)</span><span style="color: #c678dd;">)</span><span style="color: #51afef;">)</span>

<span style="color: #51afef;">(</span>set-macro-character #\' #'single-quote-reader<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
This will tell the Lisp compiler &ldquo;when you see the <code>'</code> character, take the s-expression following it, 
and give it to the function <code>single-quote-reader</code>&rdquo;. This allows us to extend the syntax of our 
language pretty simply by telling the compiler what to do when it sees a quote. Now remember how we 
had that HTML-like code, except it was still really just Lisp syntax? Well using reader macros we 
can change that and make something like this if we wanted:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #c678dd;">html</span>&gt;
  &lt;<span style="color: #c678dd;">head</span>&gt;
    &lt;<span style="color: #c678dd;">title</span>&gt;<span style="font-weight: bold; text-decoration: underline;">Hello world</span>&lt;/<span style="color: #c678dd;">title</span>&gt;
  &lt;/<span style="color: #c678dd;">head</span>&gt;
  &lt;<span style="color: #c678dd;">body</span> <span style="color: #dcaeea;">style</span>=<span style="color: #98be65;">"color: green"</span>&gt;
    &lt;<span style="color: #c678dd;">p</span>&gt;This is some green text&lt;/<span style="color: #c678dd;">p</span>&gt;
  &lt;/<span style="color: #c678dd;">body</span>&gt;
&lt;/<span style="color: #c678dd;">html</span>&gt;
</pre>
</div>

<p>
This can be perfectly valid Common Lisp or Racket code. It would get transformed by a complicated
set of reader macros into the s-expression version above, which would then get translated into some
more complicated generation code.
</p>

<p>
You can do some incredibly cool, and complicated stuff with reader macros such as:
</p>
<ul class="org-ul">
<li><a href="https://lisper.in/reader-macros">Allow JSON syntax in Lisp</a></li>
<li><a href="https://stackoverflow.com/questions/267862/what-makes-lisp-macros-so-special#answer-4621882">Write Python-like list comprehension</a></li>
<li><a href="https://github.com/y2q-actionman/with-c-syntax/">Embed C syntax directly into Lisp code</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1f78e6f" class="outline-2">
<h2 id="org1f78e6f"><span class="section-number-2">7.</span> Dialects</h2>
<div class="outline-text-2" id="text-7">
<p>
As mentioned at the beginning of the article, there are several dialects of Lisp. Some of the most common
ones are Clojure, Common Lisp, Scheme, Racket, and Emacs Lisp. If you&rsquo;re thinking of learning one of
them, <a href="which-lisp.html">maybe this can help you chose</a> a dialect to learn.
</p>
</div>
</div>

<div id="outline-container-org3f86793" class="outline-2">
<h2 id="org3f86793"><span class="section-number-2">8.</span> Conclusion</h2>
<div class="outline-text-2" id="text-8">
<p>
I hope you walk away from reading this understanding why Lisp is interesting. I know that it takes a
while to get used to it, and many people that learn it have a gut reaction to hate it, but
understanding the method behind the madness will make it easier to grasp.
</p>

<p>
If you&rsquo;re interested in taking some of the first steps to learning Lisp, check out some of the
resources below:
</p>
</div>

<div id="outline-container-orgb864614" class="outline-3">
<h3 id="orgb864614"><span class="section-number-3">8.1.</span> Clojure</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><a href="https://www.braveclojure.com/clojure-for-the-brave-and-true/">Clojure for the Brave and True</a></li>
<li><a href="https://learnxinyminutes.com/docs/clojure/">Learn Clojure in Y minutes</a></li>
<li><a href="https://clojure.org/api/cheatsheet">Clojure Cheatsheet</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9b3abad" class="outline-3">
<h3 id="org9b3abad"><span class="section-number-3">8.2.</span> Common Lisp</h3>
<div class="outline-text-3" id="text-8-2">
<ul class="org-ul">
<li><a href="https://gigamonkeys.com/book/">Practical Common Lisp (jump to Chapter 3)</a></li>
<li><a href="https://learnxinyminutes.com/docs/common-lisp/">Learn Common Lisp in Y minutes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org997cec7" class="outline-3">
<h3 id="org997cec7"><span class="section-number-3">8.3.</span> Racket</h3>
<div class="outline-text-3" id="text-8-3">
<ul class="org-ul">
<li><a href="https://docs.racket-lang.org/quick/">An introduction Racket with Pictures</a></li>
<li><a href="https://docs.racket-lang.org/more/">Systems Programming with Racket </a></li>
</ul>


<p>
And if you&rsquo;re curious about the real-world applications of Lisp, or just want some more
encouragement to learn it, lisp sees more use than you might think:
</p>
<ul class="org-ul">
<li><a href="https://lisp-lang.org/">Grammarly uses Common Lisp</a> for natural language processing</li>
<li><a href="https://lisp-lang.org/">Google&rsquo;s flight search engine uses Common Lisp</a></li>
<li><a href="https://lisp-lang.org/success/">Dozens of other companies</a> use Common Lisp to much success</li>
<li><a href="https://boards.greenhouse.io/circleci">CircleCI</a> uses <a href="https://circleci.com/blog/clojure-microservices-for-js-devs-pt-1/">Clojure extensively</a> throughout it&rsquo;s <a href="https://circleci.com/blog/deploying-clojure-applications-to-google-cloud/">full stack</a></li>
<li>Clojure is used by <a href="https://clojure.org/community/companieshundreds">hundreds of other companies</a>, like Apple, Facebook, Walmart, and more</li>
<li>Clojure developers are <a href="https://insights.stackoverflow.com/survey/2018/#work-_-salary-and-experience-by-language">consistently</a> some <a href="https://insights.stackoverflow.com/survey/2019#technology-_-what-languages-are-associated-with-the-highest-salaries-worldwide">the best paid</a> in <a href="https://insights.stackoverflow.com/survey/2021#section-top-paying-technologies-top-paying-technologies">the world</a></li>
<li><a href="https://www.gameenginebook.com/resources/SINFO.pdf">Naughty Dog used Racket for PS3 and PS4 games</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Philip</p>
<p class="date">Created: 2022-02-17 Thu 15:48</p>
</div>
</body>
</html>
